Revit 2026 API

# DocumentFamilyManager Property

---

The family manager object provides access to family types and parameters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyManager FamilyManager { get; }
```
```vb
Public ReadOnly Property FamilyManager As FamilyManager
	Get
```
```cpp
public:
property FamilyManager^ FamilyManager {
	FamilyManager^ get ();
}
```
```fsharp
member FamilyManager : FamilyManager with get
```

#### Property Value

FamilyManager

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current document is project document. |

This property is available when the document is a family document.

#### Reference

Document Class

Autodesk.Revit.DB Namespace